{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from rdflib import Graph\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON, N3\n",
    "from pprint import pprint"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2000/01/rdf-schema#label'}\tValue: {'type': 'literal', 'xml:lang': 'en', 'value': 'Matrix'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2000/01/rdf-schema#label'}\tValue: {'type': 'literal', 'xml:lang': 'ar', 'value': 'ماتريكس (توضيح)'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2000/01/rdf-schema#label'}\tValue: {'type': 'literal', 'xml:lang': 'ca', 'value': 'Matriu'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2000/01/rdf-schema#label'}\tValue: {'type': 'literal', 'xml:lang': 'cs', 'value': 'Matrix (rozcestník)'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2000/01/rdf-schema#label'}\tValue: {'type': 'literal', 'xml:lang': 'de', 'value': 'Matrix'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2000/01/rdf-schema#label'}\tValue: {'type': 'literal', 'xml:lang': 'es', 'value': 'Matrix (desambiguación)'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2000/01/rdf-schema#label'}\tValue: {'type': 'literal', 'xml:lang': 'fr', 'value': 'Matrix'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2000/01/rdf-schema#label'}\tValue: {'type': 'literal', 'xml:lang': 'in', 'value': 'Matrix'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2000/01/rdf-schema#label'}\tValue: {'type': 'literal', 'xml:lang': 'it', 'value': 'Matrix (disambigua)'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2000/01/rdf-schema#label'}\tValue: {'type': 'literal', 'xml:lang': 'ja', 'value': 'マトリックス (曖昧さ回避)'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2000/01/rdf-schema#label'}\tValue: {'type': 'literal', 'xml:lang': 'ko', 'value': '매트릭스'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2000/01/rdf-schema#label'}\tValue: {'type': 'literal', 'xml:lang': 'pl', 'value': 'Matrix (ujednoznacznienie)'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2000/01/rdf-schema#label'}\tValue: {'type': 'literal', 'xml:lang': 'nl', 'value': 'Matrix'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2000/01/rdf-schema#label'}\tValue: {'type': 'literal', 'xml:lang': 'ru', 'value': 'Матрикс'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2000/01/rdf-schema#label'}\tValue: {'type': 'literal', 'xml:lang': 'sv', 'value': 'Matrix (olika betydelser)'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2000/01/rdf-schema#label'}\tValue: {'type': 'literal', 'xml:lang': 'uk', 'value': 'Матрикс'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2000/01/rdf-schema#label'}\tValue: {'type': 'literal', 'xml:lang': 'zh', 'value': 'Matrix'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageID'}\tValue: {'type': 'typed-literal', 'datatype': 'http://www.w3.org/2001/XMLSchema#integer', 'value': '18884'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageRevisionID'}\tValue: {'type': 'typed-literal', 'datatype': 'http://www.w3.org/2001/XMLSchema#integer', 'value': '1113970790'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/David_Krejčí'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Denis_MacEoin'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Commando_(1985_film)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(EP)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(TV_series)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(composite)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(mathematics)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(protocol)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(talk_show)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_Chambers'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_Concepts_Holdings_Berhad'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_of_Leadership'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Ryoji_Ikeda'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/The_Matrix'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/The_Matrix:_Path_of_Neo'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/The_Matrix_(The_Matrix_album)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/The_Matrix_(franchise)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/The_Matrix_(production_team)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/The_Matrix_Online'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Piper_PA-46'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Hair_matrix'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Keyboard_matrix_circuit'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Toyota_Matrix'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Irving_Joshua_Matrix'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Altrenogest'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Now_He_Sings,_Now_He_Sobs'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Diode_matrix'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Guitars_and_Microphones'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Marco_Materazzi'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Martin_Gardner'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Rathkeale'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/ReBoot'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Shawn_Marion'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Hyundai_Matrix'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrice_(disambiguation)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(Doctor_Who)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(Groff_novel)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(Neuromancer)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(Perry_and_Tucker_novel)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(band)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(biology)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(chemical_analysis)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(club)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(comics)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(geology)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(journal)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(logic)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(magic_trick)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(mass_spectrometry)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(music)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(musician)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(numismatics)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(printing)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(record_production)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_Business_Technologies'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_Feminist_Design_Co-operative'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_Games'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_Partners'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_Software'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_number'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Nail_matrix'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Oberheim_Matrix_synthesizers'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/The_Matrix_(club)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/The_Matrix_(magazine)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/The_Matrix_Theatre_Company'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Variable-message_sign'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Multistate_Anti-Terrorism_Information_Exchange'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageWikiLink'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Whittington_Press'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(EP)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(TV_series)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(composite)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(mathematics)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(protocol)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(talk_show)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_Chambers'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_Concepts_Holdings_Berhad'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_of_Leadership'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/The_Matrix'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/The_Matrix:_Path_of_Neo'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/The_Matrix_(The_Matrix_album)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/The_Matrix_(franchise)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/The_Matrix_(production_team)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/The_Matrix_Online'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Hair_matrix'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Keyboard_matrix_circuit'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Toyota_Matrix'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Irving_Joshua_Matrix'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Diode_matrix'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Hyundai_Matrix'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(Doctor_Who)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(Groff_novel)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(Neuromancer)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(Perry_and_Tucker_novel)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(band)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(biology)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(chemical_analysis)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(club)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(comics)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(geology)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(journal)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(logic)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(magic_trick)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(mass_spectrometry)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(music)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(musician)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(numismatics)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(printing)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_(record_production)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_Business_Technologies'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_Feminist_Design_Co-operative'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_Games'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_Partners'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_Software'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Matrix_number'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Nail_matrix'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Oberheim_Matrix_synthesizers'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/The_Matrix_(club)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/The_Matrix_(magazine)'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageDisambiguates'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/The_Matrix_Theatre_Company'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://www.wikidata.org/entity/Q190069'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://ar.dbpedia.org/resource/ماتريكس_(توضيح)'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://bar.dbpedia.org/resource/Matrix'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://ca.dbpedia.org/resource/Matriu'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://cs.dbpedia.org/resource/Matrix_(rozcestník)'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://da.dbpedia.org/resource/Matrix_(flertydig)'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://de.dbpedia.org/resource/Matrix'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://es.dbpedia.org/resource/Matrix_(desambiguación)'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://fa.dbpedia.org/resource/ماتریس_(ابهام\\u200cزدایی)'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://fi.dbpedia.org/resource/Matrix'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://fr.dbpedia.org/resource/Matrix'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://fy.dbpedia.org/resource/Matrix'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://he.dbpedia.org/resource/מטריקס_(פירושונים)'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://hi.dbpedia.org/resource/मैट्रिक्स'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://hr.dbpedia.org/resource/Matrix'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://hu.dbpedia.org/resource/Mátrix_(egyértelműsítő_lap)'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://hy.dbpedia.org/resource/Տառամայր_(այլ_կիրառումներ)'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://id.dbpedia.org/resource/Matrix'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://it.dbpedia.org/resource/Matrix_(disambigua)'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://ja.dbpedia.org/resource/マトリックス_(曖昧さ回避)'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://ko.dbpedia.org/resource/매트릭스'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://la.dbpedia.org/resource/Matrix'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://nl.dbpedia.org/resource/Matrix'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://pl.dbpedia.org/resource/Matrix_(ujednoznacznienie)'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://ru.dbpedia.org/resource/Матрикс'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://simple.dbpedia.org/resource/Matrix'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://sk.dbpedia.org/resource/Matrix'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://sr.dbpedia.org/resource/Матрикс_(вишезначна_одредница)'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://sv.dbpedia.org/resource/Matrix_(olika_betydelser)'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://th.dbpedia.org/resource/เมทริกซ์'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://tr.dbpedia.org/resource/Matrix'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://uk.dbpedia.org/resource/Матрикс'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://ur.dbpedia.org/resource/قالب'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://vi.dbpedia.org/resource/Ma_trận'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'http://zh.dbpedia.org/resource/Matrix'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/2002/07/owl#sameAs'}\tValue: {'type': 'uri', 'value': 'https://global.dbpedia.org/id/pRoW'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/property/wikiPageUsesTemplate'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Template:Canned_search'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/property/wikiPageUsesTemplate'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Template:Disambiguation'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/property/wikiPageUsesTemplate'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Template:In_title'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/property/wikiPageUsesTemplate'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Template:Intitle'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/property/wikiPageUsesTemplate'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Template:Look_from'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/property/wikiPageUsesTemplate'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Template:TOC_right'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/property/wikiPageUsesTemplate'}\tValue: {'type': 'uri', 'value': 'http://dbpedia.org/resource/Template:Wiktionary'}\n",
      "Property: {'type': 'uri', 'value': 'http://www.w3.org/ns/prov#wasDerivedFrom'}\tValue: {'type': 'uri', 'value': 'http://en.wikipedia.org/wiki/Matrix?oldid=1113970790&ns=0'}\n",
      "Property: {'type': 'uri', 'value': 'http://dbpedia.org/ontology/wikiPageLength'}\tValue: {'type': 'typed-literal', 'datatype': 'http://www.w3.org/2001/XMLSchema#nonNegativeInteger', 'value': '5687'}\n",
      "Property: {'type': 'uri', 'value': 'http://xmlns.com/foaf/0.1/isPrimaryTopicOf'}\tValue: {'type': 'uri', 'value': 'http://en.wikipedia.org/wiki/Matrix'}\n"
     ]
    }
   ],
   "source": [
    "sparql = SPARQLWrapper('https://dbpedia.org/sparql')\n",
    "sparql.setQuery('''\n",
    "SELECT ?property ?value\n",
    "WHERE {\n",
    "  dbr:Matrix ?property ?value.\n",
    "}\n",
    "''')\n",
    "sparql.setReturnFormat(JSON)\n",
    "qres = sparql.query().convert()\n",
    "\n",
    "# pprint(qres)\n",
    "for result in qres['results']['bindings']:\n",
    "    # print(result['object'])\n",
    "    \n",
    "    lang, value = result['property'], result['value']\n",
    "    print(f'Property: {lang}\\tValue: {value}')\n",
    "    # if lang == 'en':\n",
    "        # print(value)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "SELECT ?property ?value\n",
    "WHERE {\n",
    "  dbr:Matrix ?property ?value.\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "sparql.setQuery(query)\n",
    "sparql.setReturnFormat(JSON)\n",
    "results = sparql.query().convert()\n",
    "\n",
    "# Print the results\n",
    "for result in results[\"results\"][\"bindings\"]:\n",
    "    print(f\"Country: {result['country']['value']}\")\n",
    "    print(f\"Capital: {result['capital']['value']}\")\n",
    "    print(f\"Population: {result['population']['value']}\\n\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "from SPARQLWrapper import SPARQLWrapper, JSON"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['Q189600', 'Q207536', 'Q312078', 'Q736528', 'Q864930', 'Q959892', 'Q1203242', 'Q1210827', 'Q12125299', 'Q17080059', 'Q80322391', 'Q28936']\n"
     ]
    }
   ],
   "source": [
    "\n",
    "\n",
    "def get_related_films(wikidata_id):\n",
    "  endpoint_url = \"https://query.wikidata.org/sparql\"\n",
    "    \n",
    "  # SPARQL query to get films based on the specified rules\n",
    "  query = f\"\"\"\n",
    "  SELECT DISTINCT ?z\n",
    "  WHERE {{\n",
    "      {{\n",
    "        ?x wdt:P136 ?genre.\n",
    "        ?z wdt:P136 ?genre.\n",
    "        \n",
    "        ?x wdt:P577 ?publicationDateX.\n",
    "        ?z wdt:P577 ?publicationDateZ.\n",
    "        FILTER(?publicationDateZ >= ?publicationDateX - 10 && ?publicationDateZ <= ?publicationDateX + 10)\n",
    "        FILTER(?x != ?z)\n",
    "      }}\n",
    "      UNION\n",
    "      {{\n",
    "        ?x wdt:P57 ?director.\n",
    "        ?z wdt:P57 ?director.\n",
    "        \n",
    "        FILTER(?x != ?z)\n",
    "      }}\n",
    "      UNION\n",
    "      {{\n",
    "        ?x wdt:P921 ?mainSubject.\n",
    "        ?z wdt:P921 ?mainSubject.\n",
    "        \n",
    "        FILTER(?publicationDateZ >= ?publicationDateX - 10 && ?publicationDateZ <= ?publicationDateX + 10)\n",
    "        FILTER(?x != ?z)\n",
    "      }}\n",
    "\n",
    "    VALUES ?x {{ wd:{wikidata_id} }}\n",
    "  }}\n",
    "  \"\"\"\n",
    "\n",
    "    \n",
    "  # Set up SPARQL query and execute it\n",
    "  sparql = SPARQLWrapper(endpoint_url)\n",
    "  sparql.setQuery(query)\n",
    "  sparql.setReturnFormat(JSON)\n",
    "  results = sparql.query().convert()\n",
    "  \n",
    "  # Extract and return the list of related film IDs\n",
    "  related_films = [result['z']['value'].split('/')[-1] for result in results['results']['bindings']]\n",
    "  return related_films\n",
    "\n",
    "# Example usage\n",
    "wikidata_id = \"Q83495\"  # Replace with the actual Wikidata film ID\n",
    "result = get_related_films(wikidata_id)\n",
    "print(result)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "12"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'film_id': 'Q189600', 'main_subjects': ['telepresence']}, {'film_id': 'Q207536', 'main_subjects': ['telepresence']}, {'film_id': 'Q312078', 'main_subjects': ['motor car']}, {'film_id': 'Q736528', 'main_subjects': []}, {'film_id': 'Q864930', 'main_subjects': ['organized crime']}, {'film_id': 'Q959892', 'main_subjects': []}, {'film_id': 'Q1203242', 'main_subjects': []}, {'film_id': 'Q1210827', 'main_subjects': ['artificial intelligence']}, {'film_id': 'Q12125299', 'main_subjects': []}, {'film_id': 'Q17080059', 'main_subjects': ['connection', 'LGBT']}, {'film_id': 'Q80322391', 'main_subjects': ['free will', 'virtual reality', 'love', 'actuality', 'human-machine relationship', 'dream and reality', 'autonomy', 'human nature']}, {'film_id': 'Q28936', 'main_subjects': ['cloning', 'slavery', 'seamanship']}]\n"
     ]
    }
   ],
   "source": [
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "def get_main_subjects(film_ids):\n",
    "    endpoint_url = \"https://query.wikidata.org/sparql\"\n",
    "    \n",
    "    main_subjects = []\n",
    "    \n",
    "    for film_id in film_ids:\n",
    "        # SPARQL query to get main subjects of a film\n",
    "        query = f\"\"\"\n",
    "        SELECT DISTINCT ?mainSubjectLabel\n",
    "        WHERE {{\n",
    "          wd:{film_id} wdt:P921 ?mainSubject.\n",
    "          SERVICE wikibase:label {{ bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],en\". }}\n",
    "        }}\n",
    "        \"\"\"\n",
    "        \n",
    "        # Set up SPARQL query and execute it\n",
    "        sparql = SPARQLWrapper(endpoint_url)\n",
    "        sparql.setQuery(query)\n",
    "        sparql.setReturnFormat(JSON)\n",
    "        results = sparql.query().convert()\n",
    "        \n",
    "        # Extract main subjects and add them to the main_subjects list\n",
    "        subjects = {\n",
    "            \"film_id\":film_id, \n",
    "            \"main_subjects\": [result['mainSubjectLabel']['value'] for result in results['results']['bindings']]\n",
    "        }\n",
    "        main_subjects.append(subjects)\n",
    "    \n",
    "    return main_subjects\n",
    "\n",
    "# Example usage:  # Example film IDs\n",
    "main_subjects = get_main_subjects(result)\n",
    "print(main_subjects)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Query to link film from dbpedia to wikidata\n",
    "\"\"\"PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "\n",
    "SELECT DISTINCT ?film\n",
    "WHERE {\n",
    "  ?film rdf:type dbo:Film ;\n",
    "        owl:sameAs wd:Q83495.\n",
    "}\n",
    "LIMIT 100\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd \n",
    "\n",
    "# Read the data\n",
    "df = pd.read_csv('data/IMDB-Movie-Data.csv')\n",
    "titles = df['Title'].tolist()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Guardians of the Galaxy: No Wikidata ID found\n",
      "Prometheus: No Wikidata ID found\n",
      "Split: No Wikidata ID found\n",
      "Sing: No Wikidata ID found\n",
      "Suicide Squad: No Wikidata ID found\n",
      "The Great Wall: No Wikidata ID found\n",
      "La La Land: No Wikidata ID found\n",
      "Mindhorn: No Wikidata ID found\n",
      "The Lost City of Z: No Wikidata ID found\n",
      "Passengers: No Wikidata ID found\n",
      "Fantastic Beasts and Where to Find Them: No Wikidata ID found\n",
      "Hidden Figures: No Wikidata ID found\n",
      "Rogue One: No Wikidata ID found\n",
      "Moana: No Wikidata ID found\n",
      "Colossal: No Wikidata ID found\n",
      "The Secret Life of Pets: No Wikidata ID found\n",
      "Hacksaw Ridge: No Wikidata ID found\n",
      "Jason Bourne: No Wikidata ID found\n",
      "Lion: No Wikidata ID found\n",
      "Arrival: No Wikidata ID found\n",
      "Gold: No Wikidata ID found\n",
      "Manchester by the Sea: No Wikidata ID found\n",
      "Hounds of Love: No Wikidata ID found\n",
      "Trolls: No Wikidata ID found\n",
      "Independence Day: Resurgence: No Wikidata ID found\n",
      "Paris pieds nus: No Wikidata ID found\n",
      "Bahubali: The Beginning: No Wikidata ID found\n",
      "Dead Awake: No Wikidata ID found\n",
      "Bad Moms: No Wikidata ID found\n",
      "Assassin's Creed: No Wikidata ID found\n",
      "Why Him?: No Wikidata ID found\n",
      "Nocturnal Animals: No Wikidata ID found\n",
      "X-Men: Apocalypse: No Wikidata ID found\n",
      "Deadpool: No Wikidata ID found\n",
      "Resident Evil: The Final Chapter: No Wikidata ID found\n",
      "Captain America: Civil War: No Wikidata ID found\n",
      "Interstellar: No Wikidata ID found\n",
      "Doctor Strange: No Wikidata ID found\n",
      "The Magnificent Seven: No Wikidata ID found\n",
      "5/25/1977: No Wikidata ID found\n",
      "Sausage Party: No Wikidata ID found\n",
      "Moonlight: No Wikidata ID found\n",
      "Don't Fuck in the Woods: No Wikidata ID found\n",
      "The Founder: No Wikidata ID found\n",
      "Lowriders: No Wikidata ID found\n",
      "Pirates of the Caribbean: On Stranger Tides: No Wikidata ID found\n",
      "Miss Sloane: No Wikidata ID found\n",
      "Fallen: No Wikidata ID found\n",
      "Star Trek Beyond: No Wikidata ID found\n",
      "The Last Face: No Wikidata ID found\n",
      "Star Wars: Episode VII - The Force Awakens: No Wikidata ID found\n",
      "Underworld: Blood Wars: No Wikidata ID found\n",
      "Mother's Day: No Wikidata ID found\n",
      "John Wick: No Wikidata ID found\n",
      "The Dark Knight: No Wikidata ID found\n",
      "Silence: No Wikidata ID found\n",
      "Don't Breathe: No Wikidata ID found\n",
      "Me Before You: No Wikidata ID found\n",
      "Their Finest: No Wikidata ID found\n",
      "Sully: No Wikidata ID found\n",
      "Batman v Superman: Dawn of Justice: No Wikidata ID found\n",
      "The Autopsy of Jane Doe: No Wikidata ID found\n",
      "The Girl on the Train: No Wikidata ID found\n",
      "Fifty Shades of Grey: No Wikidata ID found\n",
      "The Prestige: No Wikidata ID found\n",
      "Kingsman: The Secret Service: No Wikidata ID found\n",
      "Patriots Day: No Wikidata ID found\n",
      "Mad Max: Fury Road: No Wikidata ID found\n",
      "Wakefield: No Wikidata ID found\n",
      "Deepwater Horizon: No Wikidata ID found\n",
      "The Promise: No Wikidata ID found\n",
      "Allied: No Wikidata ID found\n",
      "A Monster Calls: No Wikidata ID found\n"
     ]
    }
   ],
   "source": [
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "def get_wikidata_id(film_title):\n",
    "    endpoint_url = \"https://query.wikidata.org/sparql\"\n",
    "    \n",
    "    # SPARQL query to get the Wikidata ID of a film\n",
    "    query = f\"\"\"\n",
    "    SELECT DISTINCT ?film\n",
    "    WHERE {{\n",
    "      ?film rdf:type dbo:Film ;\n",
    "            rdfs:label \"{film_title}\"@en.\n",
    "    }}\n",
    "    LIMIT 1\n",
    "    \"\"\"\n",
    "    \n",
    "    # Set up SPARQL query and execute it\n",
    "    sparql = SPARQLWrapper(endpoint_url)\n",
    "    sparql.setQuery(query)\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    results = sparql.query().convert()\n",
    "    \n",
    "    # Extract and return the Wikidata ID\n",
    "    wikidata_id = results['results']['bindings'][0]['film']['value'].split('/')[-1]\n",
    "    return wikidata_id\n",
    "\n",
    "wikidata_ids = []\n",
    "for title in titles:\n",
    "    try:\n",
    "        wikidata_id = get_wikidata_id(title)\n",
    "        wikidata_ids.append(wikidata_id)\n",
    "    except:\n",
    "        print(f\"{title}: No Wikidata ID found\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "\n",
    "def query_films_from_wikidata():\n",
    "    print(\"Querying films from Wikidata...\")\n",
    "    sparql = SPARQLWrapper(\"https://query.wikidata.org/sparql\")\n",
    "    sparql.setQuery(\"\"\"\n",
    "        SELECT DISTINCT ?item ?title ?year ?director ?image ?idwikidata WHERE {\n",
    "            ?item wdt:P31 wd:Q11424.\n",
    "            ?item wdt:P1476 ?title. \n",
    "            OPTIONAL { ?item wdt:P577 ?date. BIND(YEAR(?date) AS ?year) }\n",
    "            OPTIONAL { ?item wdt:P57 ?director_item. ?director_item rdfs:label ?director. FILTER(LANG(?director) = \"en\") }\n",
    "            OPTIONAL { ?item wdt:P18 ?image }\n",
    "            BIND(REPLACE(STR(?item), \".*Q\", \"Q\") AS ?idwikidata)\n",
    "            FILTER(LANG(?title) = \"en\")\n",
    "        }\n",
    "        LIMIT 10\n",
    "    \"\"\")\n",
    "    sparql.setReturnFormat(JSON)\n",
    "    results = sparql.query().convert()\n",
    "    films = []\n",
    "    print(\"Processing results...\")\n",
    "    for result in results[\"results\"][\"bindings\"]:\n",
    "        film = {\n",
    "            \"title\": result[\"title\"][\"value\"],\n",
    "            \"year\": result.get(\"year\", {}).get(\"value\"),\n",
    "            \"director\": result.get(\"director\", {}).get(\"value\") if \"director\" in result else None,\n",
    "            \"image\": result.get(\"image\", {}).get(\"value\") if \"image\" in result else None,\n",
    "            \"idwikidata\": result[\"idwikidata\"][\"value\"]\n",
    "        }\n",
    "        if film[\"idwikidata\"] not in [f[\"idwikidata\"] for f in films]:\n",
    "            films.append(film)\n",
    "        else:\n",
    "            index = next((i for i, f in enumerate(films) if f[\"idwikidata\"] == film[\"idwikidata\"]), None)\n",
    "            if film[\"director\"] and film[\"director\"] not in films[index][\"director\"]:\n",
    "                films[index][\"director\"] += \", \" + film[\"director\"]\n",
    "            if film[\"year\"] and film[\"year\"] not in films[index][\"year\"]:\n",
    "                films[index][\"year\"] = min(films[index][\"year\"], film[\"year\"])\n",
    "\n",
    "    return films"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Querying films from Wikidata...\n",
      "Processing results...\n"
     ]
    }
   ],
   "source": [
    "films = query_films_from_wikidata()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'title': 'Africa Screams',\n",
       "  'year': '1950',\n",
       "  'director': 'Charles Barton',\n",
       "  'image': 'http://commons.wikimedia.org/wiki/Special:FilePath/Africa%20screams%20title%20screen.JPG',\n",
       "  'idwikidata': 'Q23892'},\n",
       " {'title': 'Whale Rider',\n",
       "  'year': '2002',\n",
       "  'director': 'Niki Caro',\n",
       "  'image': None,\n",
       "  'idwikidata': 'Q19393'},\n",
       " {'title': 'Paradise Alley',\n",
       "  'year': '1978',\n",
       "  'director': 'Sylvester Stallone',\n",
       "  'image': None,\n",
       "  'idwikidata': 'Q19268'},\n",
       " {'title': 'Dances with Wolves',\n",
       "  'year': '1990',\n",
       "  'director': 'Kevin Costner',\n",
       "  'image': 'http://commons.wikimedia.org/wiki/Special:FilePath/Kevin%20Costner%20-Dances%20with%20Wolves.jpg',\n",
       "  'idwikidata': 'Q20456'},\n",
       " {'title': 'Alligator II - The Mutation',\n",
       "  'year': '1991',\n",
       "  'director': 'Jon Hess',\n",
       "  'image': None,\n",
       "  'idwikidata': 'Q24151'},\n",
       " {'title': 'Signs',\n",
       "  'year': '2002',\n",
       "  'director': 'M. Night Shyamalan',\n",
       "  'image': None,\n",
       "  'idwikidata': 'Q22432'},\n",
       " {'title': 'Visions of Light',\n",
       "  'year': '1992',\n",
       "  'director': 'Todd McCarthy',\n",
       "  'image': None,\n",
       "  'idwikidata': 'Q24258'}]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "films"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
